In [1]:
!pip install word2number

Requirement already satisfied: word2number in c:\users\dell\anaconda3\lib\site-packages (1.1)

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from word2number import w2n
from sklearn import linear_model
%matplotlib inline

In [3]:
data=pd.read_csv("hiring.csv")
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
# Convert words to numbers in the 'experience' column
data['experience'] = data['experience'].apply(lambda x: w2n.word_to_num(x) if isinstance(x, str) else x)

In [5]:
data.isna().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [6]:
# we can fill the null value in experinece by '0' and test score by median
data['experience']=data['experience'].fillna(0)
median_test_score = data['test_score(out of 10)'].median()
data['test_score(out of 10)'].fillna(median_test_score, inplace=True)
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         0.0                    8.0                           9      50000
1         0.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000

In [7]:
reg=linear_model.LinearRegression()
reg.fit(data[['experience','test_score(out of 10)','interview_score(out of 10)']],data['salary($)'])

LinearRegression()

In [8]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [9]:
reg.intercept_

17737.263464337688

In [10]:
reg.predict([[2,10,10]])

array([63872.63464338])